#include <pspkernel.h>
#include <string.h>

#include "usb.h"
#include "usb_internal.h"

PSP_MODULE_INFO ("sceUSB_Driver", 0x1007, 1, 2);





/* Global variables */
struct usb_queue g_queues[PSP_USB_MAX_ENDPOINTS];     /* 0xA884 */

int g_usb_version;                            /* 0xA960 */
int g_prev_cable_connected = PSP_USB_STATUS_CABLE_CONNECTED; /* 0xA964 */
int g_usb_activated = PSP_USB_STATUS_DEACTIVATED;            /* 0xA968 */
int g_cable_connected = PSP_USB_STATUS_CABLE_DISCONNECTED;   /* 0xA96C */
int g_connection_status = PSP_USB_STATUS_CONNECTION_NEW;     /* 0xA970 */
int g_total_interfaces;                       /* 0xA974 */
int g_total_endpoints;                        /* 0xA978 */

SceUID g_mainsema;                            /* 0xA9EC */
static SceUID g_usbeventflag;                 /* 0xA9F0 */

struct usb_endpoint g_endpoints[PSP_USB_MAX_ENDPOINTS + 1];   /* 0xAAC0 */
struct usb_rxfifo g_rxfifos[PSP_USB_MAX_ENDPOINTS];           /* 0xAC28 */

static short g_clearedendpoints;              /* 0xACDC */
static short g_stalledendpoints;              /* 0xACDE */
static short g_ace0;                          /* 0xACE0 */
static short g_isochronoustransfers;          /* 0xACE2 */
static SceUID g_swfifofpl;                    /* 0xACE4 */
static SceUID g_mainalarm;                    /* 0xACE8 */
static volatile struct usb_port *g_defaultport;        /* 0xACEC */

static struct usb_port g_ports[21]; /* 0xAD00 */



/* Static functions */

static int check_fifos (void);
static int check_request (struct UsbbdDeviceRequest *req);

static int usb_interrupt_handler (void);
static int usb_connect_interrupt_handler (void);
static int usb_disconnect_interrupt_handler (void);
static int usb_ready_interrupt_handler (void);
static int usb_resume_interrupt_handler (void);

static int check_fifo (struct UsbDriver *driver, struct DeviceDescriptor *devp, struct UsbConfiguration *confp);

static int on_module_start (void);
static int on_module_stop (void);

static int release_bus_driver (void);
static int start_bus_driver (void);


static int queue_pop (struct usb_queue *queue, int retcode);
static void prepare_send (int endpnum);

static void cancel_recv_all (void);
static void configure_rxdma_fifo (struct usb_endpoint *t, int usefirst);

static int get_devrequest (void);
static void check_stall_or_clear (void);
static int sub_66F8 (struct usb_endpoint *t);
