#include <pspkernel.h>
#include <pspidstorage.h>
#include <string.h>

#include "usb.h"
#include "usb_internal.h"

/* Structures */
struct StorageStringDescriptor {
  unsigned int id;
  struct StringDescriptor str;
};

/* Variables */
struct DeviceDescriptor *g_devdesc_hi;        /* 0xA97C */
struct UsbConfiguration *g_conf_hi;           /* 0xA980 */
struct DeviceDescriptor *g_devdesc;           /* 0xA984 */
struct UsbConfiguration *g_conf;              /* 0xA988 */
struct StringDescriptor *g_descriptors;       /* 0xA98C */
struct DeviceQualifierDescriptor *g_qual_hi;  /* 0xA990 */
struct DeviceQualifierDescriptor *g_qual;     /* 0xA994 */
static void *g_configpacket_hi;               /* 0xA998 */
static void *g_configpacket;                  /* 0xA99C */
struct StringDescriptor *g_string;            /* 0xA9A0 */
struct StringDescriptor *g_vendor_desc;       /* 0xA9A4 */
struct StringDescriptor *g_product_desc;      /* 0xA9A8 */
static int g_desccount;                       /* 0xA9AC */

struct DeviceRequest g_devreq;                /* 0xA9B0 */
struct UsbEndpoint g_ep0;                     /* 0xA9B8 */
struct UsbbdDeviceRequest g_request;          /* 0xA9C4 */

SceUID g_devdescfpl;                          /* 0xA9F4 */
SceUID g_fsconffpl;                           /* 0xA9F8 */
SceUID g_hsconffpl;                           /* 0xA9FC */

SceUID g_ep0fpl;                              /* 0xAA00 */

static struct StringDescriptor g_default_desc = {
    4,
    3,
    { 1033  }
};                                            /* 0xAA0C */


/* Function Prototypes */
static int load_device_strings (unsigned int productId, int strcount[9]);
static struct UsbConfiguration *load_configuration (int usb_version, int strcount[9]);

static int read_idstorage (int pid, struct StorageStringDescriptor *vendor_desc, struct StorageStringDescriptor *product_desc);

static void make_device_qualifier (struct DeviceDescriptor *device, struct DeviceQualifierDescriptor *qualifier);
static void make_packet (struct ConfigDescriptor *from, char *buffer);

static int process_class_request (void);
static int process_standard_request (struct DeviceRequest *req);

static int configure_endpoint (struct EndpointDescriptor *endp);
static void clear_endpoint_status (int endpoint);


/* Subroutine at 0x0760 */
